#include <iostream>//#include-використовуется для підключення інших файлів у код. <iostream>-одна з бібліотек мови С
#include <cstdlib>//#include-використовуется для підключення інших файлів у код. <cstdlib>-одна з бібліотек мови С
using namespace std;//простір імен, для логічного угрупування ідентифікаторів.

int main()//головна фунція яка є керуючою, без неї не буде працювати код
{ //фігурні скобки обовязково йдуть після функції 'int main', і все що в них знаходится виконуется автоматично після запуску программи.
	cout << "Hello World"<<endl;/*cout - відповідае за виведення текста на єкран. << "Hello World" << -це текст який буде виводитись,
	він обовязково повинен бути у лапках. endl-команда якою наступна строка переводится на рівень нижче.
	;-кожна строка повинна закінчуватись на крапку з комою.*/
	system("pause");//робить паузу у контекстному вікні, та чекае будь якого ввода.
	return 0;//ця команда передае операцийній системі про вдачне завершеня программи.
}